
ʼclass RegionsSeed
  REGION_NAMES = ['Київська область', 'Вінницька область', 'Волинська область',
                  'Дніпропетровська область', 'Донецька область', 'Житомирська область',
                  'Закарпатська область', 'Запорізька область', 'Івано-Франківська область',
                  'Кіровоградська область', 'Крим', 'Луганська область', 'Львівська область',
                  'Миколаївська область', 'Одеська область', 'Полтавська область',
                  'Рівненська область', 'Сумська область', 'Тернопільська область',
                  'Харківська область', 'Херсонська область', 'Хмельницька область',
                  'Черкаська область', 'Чернівецька область', 'Чернігівська область']

  def self.run
    REGION_NAMES.each do |name|
      Region.find_or_create_by(name: name)
    end
  end
end
